<template>
    <div>
        <div class="faq-header">
            <div v-for="f in faq">
                <div
                    class="faq-header-element"
                    v-if="f.isActive"
                    style="background-color:#4787F3;color:white"
                    v-on:click="setQuestion(f)"
                >
                    {{f.name}}
                </div>
                <div
                    class="faq-header-element"
                    v-else
                    v-on:click="setQuestion(f)"
                >
                    {{f.name}}
                </div>
            </div>
        </div>
        <div style="width:100%;display:flex">
            <div class="question-list">
                <div v-for="question in questions">
                    <div
                        class="question question-active"
                        v-if="question.isActive == true"
                        style="background-color:background: #F6F6F6;"
                        v-on:click="setAnswer(question)"
                    >
                        <div style="width:80%">
                        {{question.title}}
                        </div>
                        <div style="width:20%">
                            <div class="float-right">
                                <svg viewBox="0 0 10 16" fill="none" xmlns="http://www.w3.org/2000/svg" class="question-icon">
                                    <path d="M1.5 1L8.5 8L1.5 15" stroke="#1776BB" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                </svg>
                            </div>
                        </div>
                    </div>
                    <div
                        class="question"
                        v-else
                        v-on:click="setAnswer(question);"
                        :id="'question-' + question.id"
                    >
                        <div style="width:80%">
                        {{question.title}}
                        </div>
                        <div style="width:20%">
                            <div class="float-right">
                                <svg viewBox="0 0 10 16" fill="none" xmlns="http://www.w3.org/2000/svg" class="question-icon">
                                    <path d="M1.5 1L8.5 8L1.5 15" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                </svg>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div class="answer">
                <div class="answer-title">{{answer.title ?? ''}}</div>
                <small class="answar-description">{{answer.description ?? ''}}</small>
            </div>
        </div>
    </div>
</template>
<style scoped>
    .faq-header{
        width: 100%;
        display: flex;
        margin-bottom: 32px;
    }
    .faq-header-element{
        padding: 16px;
        background-color:#F8F8F8;
        border-radius: 8px;
        margin-right:24px;
        cursor: pointer;
    }
    .question-list{
        width:50%;
        position: relative;
        box-shadow: 0px 4px 20px -5px rgba(0, 0, 0, 0.04);
    }
    .question{
        padding: 24px 20px 24px 20px;
        border-left: 2px solid #C7D1D7;
        display:flex;
        width:100%;
        cursor: pointer;
    }
    .answer{
        padding-top:69px;
        width: 50%;
        padding-left: 64px;
    }
    .answer-title{
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: #1F2021;
        margin-bottom:40px;
    }
    .answer-description{
        font-weight: 400;
        font-size: 14px;
        line-height: 150%;
        color: #616161;
    }
    .question-icon{
        width:8px;
        height:16px;
    }
    .question-active{
        background:#F6F6F6;
        border-left: 2px solid #1776BB;
    }
    .question-active .question-icon path{
        stroke:#1776BB;
    }
    .question-icon path{
        stroke: #C7D1D7;
    }
</style>
<script>
export default {
    data() {
        return {
            faq: {
                "0": {
                    id: 1,
                    name: "Работа паркинга",
                    data: {
                        "0": {
                            id: 1,
                            title: "Кстати,  ключевые особенности структуры проекта?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "1": {
                            id: 2,
                            title: "Внедрение современных редставляет собой интересный методик играет важную роль?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "2": {
                            id: 3,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "3": {
                            id: 4,
                            title: "Граница обучения кадров представляет собой интересный?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "4": {
                            id: 5,
                            title: "Вот вам яркий пример современных тенденций  современных методик играет важную роль?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                    }
                },
                "1": {
                    id: 2,
                    name: "Пропуск",
                    isActive: false,
                    data: {
                        "0": {
                            id: 1,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "1": {
                            id: 2,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "2": {
                            id: 3,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "3": {
                            id: 4,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                        "4": {
                            id: 5,
                            title: "С другой стороны, консультация с широким активом?",
                            description: "Есть над чем задуматься: сторонники тоталитаризма в науке формируют глобальную экономическую сеть и при этом -  заблокированы в рамках своих собственных рациональных ограничений. Банальные, но неопровержимые выводы, а также непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований!"
                        },
                    }
                }
            },
            questions: null,
            answer: {
                title: '',
                description: ''
            }
        }
    },
    methods: {
        setQuestion(faq) {
            this.questions = faq.data;

            for (let key in this.faq){
                if( this.faq[key].id == faq.id) {
                    this.faq[key].isActive = true
                } else {
                    this.faq[key].isActive = false
                }
            }
            
            for( let key in this.questions ) {
                this.questions[key].isActive = false;
            }
            this.answer = {
                title: '',
                description: ''
            };
        },
        setAnswer(answer) {
            this.answer = answer;
            for (let key in this.questions){
                if( this.questions[key].id == answer.id) {
                    this.questions[key].isActive = true
                } else {
                    this.questions[key].isActive = false
                }
            }
        }
    }
}
</script>